
function initialize() {

	// Global stuff
	min_height = 0;
	max_height = 2109;
	markers = [];

	// Initial configuration
  var options = {
    zoom: 7,
    center: new google.maps.LatLng(64.8, -18),
    mapTypeId: google.maps.MapTypeId.SATELLITE
  }
  var map = new google.maps.Map(document.getElementById("map_canvas"), options);

  // Creates markers
  for (var i = 0; i < mountains.length; i++) {
    var mountain = mountains[i];
    var location = new google.maps.LatLng(mountain[1], mountain[2]);
    var marker = new google.maps.Marker({
        map:			map,
        title:		mountain[0],
        position: location,
    });
		markers[i] = marker;
  }

	// Initializes the slider.
	$("#slider-range").slider({
		range: true,
		min: min_height,
		max: max_height,
		values: [min_height, max_height],
		slide: function(event, ui) {
			min_height = parseInt(ui.values[0]);
			max_height = parseInt(ui.values[1]);
			update();
		}
	});

	update();
}

function update() {
	$("#alt-range").text(min_height + " - " + max_height + " metrar.");
	for (var i = 0; i < mountains.length; i++) {
		// TODO: Code duplication.
		var mountain = mountains[i];
		var is_visible = mountain[3] >= min_height && mountain[3] <= max_height; 
		markers[i].setVisible(is_visible);
	}
}

/* The actual data. */
var mountains = [
	['Akrafjall', 64.34351700, -21.91630000, 643, 500],
	['Arnarfell hið mikla', 64.69446700, -18.66255000, 1137, 517],
	['Arnarfell við Þingvallavatn', 64.21738300, -21.07573300, 239, 110],
	['Ármannsfell', 64.31358300, -21.01588300, 764, 600],
	['Baula', 64.84900000, -21.43950000, 917, 700],
	['Birnudalstindur', 64.24495000, -15.93203300, 1326, 1275],
	['Bjarnarhafnarfjall', 64.98693300, -23.00500000, 575, 545],
	['Bláfell', 64.48815000, -19.85808300, 1204, 600],
	['Blámannshattur', 65.92613300, -18.00153300, 1214, 1150],
	['Brekkukambur', 64.42156700, -21.46978300, 646, 640],
	['Brennisteinsalda', 63.98081700, -19.09525000, 881, 230],
	['Búlandstindur', 64.69101700, -14.40368300, 1069, 1020],
	['Búrfell í Grímsnesi', 64.09476700, -20.93720000, 534, 430],
	['Búrfell í Þingvallasveit', 64.30628300, -21.21563300, 783, 600],
	['Dór', 63.99740000, -21.59035000, 876, 180],
	['Drápuhlíðarfjall', 64.97403300, -22.72135000, 527, 477],
	['Dyrfjöll', 65.50455000, -13.95286700, 1136, 1080],
	['Dýjafjallshnjúkur', 65.75340000, -18.52506700, 1445, 1295],
	['Einhyrningur', 63.74003300, -19.47271700, 651, 350],
	['Eiríksjökull', 64.77085000, -20.39888300, 1672, 1320],
	['Ernir', 66.06635000, -23.07935000, 628, 580],
	['Eyjafjallajökull', 63.63045000, -19.59178300, 1651, 1530],
	['Fanntófell', 64.54575000, -20.93786700, 901, 380],
	['Festarfjall', 63.85925000, -22.33180000, 201, 50],
	['Geirhnúkur', 64.91795000, -21.99155000, 898, 748],
	['Geitafell', 63.94220000, -21.52110000, 509, 300],
	['Geitlandsjökull', 64.60013300, -20.59010000, 1390, 740],
	['Grasgiljatindur', 64.46781700, -15.33085000, 1267, 1200],
	['Grendill', 64.60136700, -15.42096700, 1564, 660],
	['Grímannsfell', 64.15956700, -21.52011700, 482, 420],
	['Grímsstaðamúli', 64.71253300, -21.93885000, 495, 370],
	['Hafnarfjall', 64.49651700, -21.89270000, 844, 740],
	['Hafrafell', 64.69325000, -20.56208300, 1165, 565],
	['Hafursey', 63.52215000, -18.77455000, 582, 440],
	['Hagafjall', 64.08188300, -20.04521700, 470, 345],
	['Hatta', 63.44155000, -19.00695000, 504, 360],
	['Hádegishnúkur', 64.65031700, -21.06306700, 1076, 450],
	['Háskerðingur', 63.89343300, -19.12225000, 1281, 450],
	['Hátindur', 64.24410000, -21.60155000, 909, 800],
	['Hekla', 63.99148300, -19.67393300, 1491, 1040],
	['Helgafell  í Mosfellssveit', 64.17421700, -21.65165000, 215, 100],
	['Helgafell ofan Hafnarfjarðar', 64.01041700, -21.85125000, 338, 260],
	['Helgrindur', 64.89700000, -23.35253300, 988, 948],
	['Hengill', 64.08403300, -21.31533300, 805, 500],
	['Herðubreið', 65.17375000, -16.34515000, 1677, 1190],
	['Hestfjall í Borgarfirði', 64.56000000, -21.65841700, 221, 140],
	['Hestfjall í Grímsnesi', 64.01828300, -20.67006700, 322, 260],
	['Hestskarðshnjúkur', 66.13340000, -18.85528300, 855, 735],
	['Hlöðufell', 64.41941700, -20.53376700, 1186, 740],
	['Hólmatindur', 65.05693300, -14.04861700, 985, 930],
	['Hrafnabjörg', 64.27246700, -20.92160000, 763, 220],
	['Hreppsendasúlur', 65.94930000, -18.88355000, 1052, 850],
	['Hrolleifsborg', 66.16425000, -22.18456700, 851, 780],
	['Hrútaborg', 64.83993300, -22.13668300, 879, 760],
	['Hrútfell', 64.72860000, -19.76158300, 1396, 850],
	['Hrútsfjallstindar', 64.05156700, -16.73851700, 1756, 1650],
	['Húsavíkurfjall', 66.04575000, -17.30156700, 417, 367],
	['Húsfell', 64.02655000, -21.79940000, 288, 170],
	['Hvalfell', 64.38505000, -21.20931700, 852, 700],
	['Hvannadalshnúkur', 64.01448300, -16.66161700, 2109, 2000],
	['Hvítserkur', 65.43506700, -13.75123300, 771, 370],
	['Högnhöfði', 64.35808300, -20.49963300, 1002, 500],
	['Ingólfsfjall', 63.97643300, -21.04150000, 551, 500],
	['Jarlhettur', 64.49815000, -20.17995000, 943, 590],
	['Jökulborg', 65.57655000, -18.39885000, 1421, 1331],
	['Jökulgilstindar', 64.51418300, -14.96086700, 1313, 1200],
	['Jörundarfell', 65.46558300, -20.26036700, 1088, 1070],
	['Kaldbakshorn', 65.85685000, -21.30150000, 525, 510],
	['Kaldbakur', 65.82133300, -23.65710000, 998, 950],
	['Kálfstindar', 64.24768300, -20.86540000, 824, 620],
	['Keilir', 63.94125000, -22.17240000, 378, 280],
	['Kerhólakambur', 64.23625000, -21.73830000, 851, 800],
	['Kerling', 65.55750000, -18.25706700, 1536, 1450],
	['Kerlingar', 64.39518300, -17.99991700, 1270, 570],
	['Kirkjufell', 64.94085000, -23.30745000, 463, 450],
	['Kjalfell', 64.77505000, -19.54510000, 1008, 400],
	['Klakkur', 65.54218300, -21.50831700, 999, 530],
	['Klifatindur', 64.27438300, -15.00401700, 889, 690],
	['Klofningsfjall', 65.21480000, -22.37795000, 645, 630],
	['Kollóttadyngja', 65.22098300, -16.54866700, 1180, 400],
	['Krafla', 65.71410000, -16.73006700, 813, 210],
	['Krákur', 64.95930000, -19.87355000, 1188, 590],
	['Kristínartindar', 64.06341700, -16.92611700, 1126, 1030],
	['Kverkfjöll', 64.64168300, -16.71971700, 1600, 800],
	['Kvígindisfell', 64.40791700, -21.06278300, 783, 630],
	['Lambafell', 64.01830000, -21.46888300, 546, 160],
	['Lambatindur', 64.93878300, -14.24848300, 854, 814],
	['Látrabjarg', 65.48893300, -24.47320000, 441, 411],
	['Litla-Björnsfell', 64.49940000, -20.77901700, 914, 390],
	['Ljósufjöll', 64.91945000, -22.61305000, 1063, 990],
	['Loðmundur', 64.65030000, -19.20906700, 1429, 630],
	['Lómagnúpur', 63.99276700, -17.52481700, 764, 685],
	['Lyngbrekkutindur', 64.22008300, -16.42948300, 1300, 500],
	['Löðmundur', 64.06473300, -19.19091700, 1079, 480],
	['Miðfell í Hreppum', 64.11320000, -20.33156700, 251, 150],
	['Miðfellstindur', 64.12125000, -16.95858300, 1430, 1230],
	['Miklafell í Hofsjökli', 64.88343300, -18.54055000, 1468, 690],
	['Móskarðahnúkar', 64.24273300, -21.54760000, 807, 675],
	['Mælifellshnjúkur', 65.38881700, -19.35176700, 1147, 830],
	['Ok', 64.59895000, -20.88005000, 1170, 440],
	['Rauðkollur', 64.81895000, -19.72700000, 1075, 315],
	['Rauðufossafjöll', 63.97645000, -19.40843300, 1206, 356],
	['Reykjaneshyrna', 66.02405000, -21.40018300, 316, 250],
	['Rjúpnafell', 63.69731700, -19.40860000, 824, 630],
	['Rótarfjallshnúkur', 63.97846700, -16.66410000, 1848, 1750],
	['Sauðhamarstindur', 64.53676700, -15.23513300, 1319, 1090],
	['Seldalsfjall', 65.43995000, -18.68141700, 1071, 520],
	['Seljafell', 64.90053300, -22.81610000, 571, 430],
	['Skarðsheiði', 64.46745000, -21.77523300, 1053, 960],
	['Skálafell', 63.99191700, -21.32441700, 574, 280],
	['Skessuhorn', 64.49281700, -21.69996700, 963, 900],
	['Skjaldbreiður', 64.40930000, -20.75113300, 1066, 550],
	['Skriða', 64.35513300, -20.68258300, 901, 300],
	['Skriðufell', 64.61188300, -19.91441700, 1235, 635],
	['Skúmhöttur', 65.04245000, -14.48083300, 1229, 1100],
	['Snæfell norðan Vatnajökuls', 64.79765000, -15.55908300, 1833, 1030],
	['Snæfell sunnan Vatnajökuls', 64.23226700, -16.18675000, 1324, 1174],
	['Snæfellsjökull', 64.80960000, -23.77488300, 1446, 1100],
	['Snækollur', 64.64371700, -19.22818300, 1488, 690],
	['Spákonufell', 65.84320000, -20.24676700, 639, 610],
	['Stapatindur', 63.94846700, -21.98398300, 397, 237],
	['Stóra-Björnsfell', 64.49535000, -20.69720000, 989, 380],
	['Stóra-Kóngsfell', 64.00076700, -21.66075000, 602, 192],
	['Stóra-Reykjafell', 64.02773300, -21.39033300, 540, 300],
	['Stóri-Meitill', 64.00041700, -21.43233300, 514, 250],
	['Strútur', 64.74905000, -20.68130000, 937, 600],
	['Stöng', 64.77983300, -14.35283300, 965, 955],
	['Sunnutindur', 64.66660000, -14.88361700, 1158, 1040],
	['Súlur', 65.60350000, -18.19795000, 1213, 1163],
	['Sveinstindur', 64.10581700, -18.41765000, 1089, 390],
	['Syðri-Hásteinar', 64.80088300, -18.74825000, 1628, 830],
	['Syðsta-Súla', 64.33666700, -21.16085000, 1093, 970],
	['Sýrfell', 63.83800000, -22.65800000, 95, 75],
	['Tindastóll', 65.85443300, -19.78541700, 995, 950],
	['Trölladyngja á Reykjanesskaga', 63.94073300, -22.09666700, 375, 265],
	['Trölladyngja norðan Vatnajökuls', 64.89508300, -17.25145000, 1459, 680],
	['Tröllakirkja í Hítardal', 64.87318300, -21.82503300, 939, 770],
	['Tröllakirkja vestan Holtavörðuheiðar', 65.00476700, -21.18800000, 1001, 700],
	['Tungnafellsjökull', 64.73705000, -17.98505000, 1539, 620],
	['Vaðalfjöll', 65.58130000, -22.07375000, 609, 540],
	['Valahnúkar', 64.08780000, -19.48125000, 721, 260],
	['Vindbelgjarfjall', 65.62423300, -17.06833300, 524, 240],
	['Vífilsfell', 64.03868300, -21.55645000, 655, 305],
	['Vörðutindur', 64.34601700, -15.71041700, 1057, 967],
	['Ýmir', 63.78595000, -19.56760000, 1464, 590],
	['Þórisjökull', 64.54208300, -20.70705000, 1329, 630],
	['Þóristindur', 64.17545000, -18.91923300, 826, 300],
	['Þríhyrningur', 63.78891700, -19.96330000, 675, 410],
	['Þverártindsegg', 64.19925000, -16.14221700, 1554, 1500],
	['Þverfell við Reyðarvatn', 64.47221700, -21.09338300, 655, 350],
	['Þyrill', 64.39311700, -21.40620000, 393, 350]
];
